
/*Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵)
2, 4 -> 16
*/
/*
double number_a = double.Parse(Console.ReadLine());
double number_b = double.Parse(Console.ReadLine());

double result = Math.Pow(number_a, number_b);
Console.WriteLine(result);
*/

